USE librarydb;
-- паролі до акаунтів = юзернейми
INSERT INTO users
(username, email, password, role)
VALUES
    (
     'admin1',
     'admin1@gmail.com',
     '$2a$10$0FXMJxDTGcZQ9PocAUAk/OnH3tCToH52cZ/N5sw2bZbp7JoGYbxJK',
     'ADMIN'
    ),
    (
        'client2',
        'client2@gmail.com',
        '$2a$10$uZEzCd0DF0X3hoGOSt/jFOULGxZXMVHhgbo0JFhCHFiL4JUJ1UrnC',
        'CLIENT'
    ),
    (
        'client3',
        'client3@gmail.com',
        '$2a$10$Ixq6EnSDKkBEgUu80eDBy.qnOhs3XOaCPqTnudgxNxgCLhXb0t8dG',
        'CLIENT'
    ),
    (
        'client4',
        'client4@gmail.com',
        '$2a$10$cQmOI5TMqIvYmIfKGqNf5eGAtspuEauT5Ei8WcrMwnAZifsvN1/My',
        'CLIENT'
    ),
    (
        'client5',
        'client5@gmail.com',
        '$2a$10$xHIFRdxKIlAvAUHUWF8ksOUWYBJSgxEpQXuHkxJiGcK0QQHad60By',
        'CLIENT'
    );

INSERT INTO books
(title, author, description, genre)
VALUES
    (
        'Дивна історія доктора Джекіла й містера Гайда',
        'Роберт Луїс Стівенсон',
        '«Химерна пригода доктора Джекіла й містера Гайда» (1886) - знаменита готична повість
        Роберта Стівенсона про двійництво та боротьбу добра і зла всередині людини. Сюжет розповідає
        про лікаря, який через експерименти звільняє своє «друге я» - жорстокого містера Гайда.',
        'Художня література'
    ),
    (
        'Острів скарбів',
        'Роберт Луїс Стівенсон',
        '«Острів скарбів» (1883) — класичний пригодницький роман Роберта Луїса Стівенсона про небезпечну
        подорож за скарбами пірата Флінта. Історія розгортається у XVIII ст. і ведеться від імені юного
        Джима Гокінса. Джим знаходить карту скарбів у речах померлого пірата Біллі Бонса, що зупинився
        в заїзді його батьків. Разом із доктором Лівсі та сквайром Трелоні вони наймають корабель
        «Еспаньйола» та разом вирушають на пошуки, протистоячи команді одноногого Джона Сільвера.',
        'Пригоди'
    ),
    (
        '1984',
        'Джордж Оруелл',
        '«1984» — культовий роман-антиутопія Джорджа Орвелла, опублікований у 1949 році, який описує
        тоталітарне суспільство майбутнього. Книга зображує світ тотального контролю, де Партія на
        чолі з Великим Братом стежить за громадянами, викорінює свободу думки та переписує історію.',
        'Антиутопія'
    ),
    (
        'Вбивство у «Східному експресі»',
        'Агата Крісті',
        '«Вбивство у «Східному експресі» — це знаменитий детективний роман Агати Крісті, у якому
        бельгійський детектив Еркюль Пуаро розслідує вбивство американського магната Семюела Ретчетта.
        Злочин стається у розкішному потязі, що застряг у снігових заметах, тому підозрюваними стають
        усі пасажири одного вагона, кожен з яких приховує свою таємницю.',
        'Детектив'
    ),
    (
        'Гра дзеркал',
        'Агата Крісті',
        '«Гра дзеркал» — класичний детективний роман Агати Крісті з циклу про міс Марпл. За сюжетом,
        міс Марпл розслідує замах на вбивство та вбивство в будинку своєї подруги Керрі-Луїзи, де
        серед родичів і гостей панує напружена атмосфера, інтриги та приховані мотиви.',
        'Детектив'
    ),
    (
        'Тіло в бібліотеці',
        'Агата Крісті',
        '«Тіло в бібліотеці» (1942) — класичний детектив Агати Крісті із серії про міс Марпл, що
        розповідає про шокуюче вбивство в поважному англійському маєтку. Сюжет розгортається навколо
        знайденого рано-вранці в бібліотеці полковника Бентрі тіла невідомої молодої жінки, одягненої
        у вечірню сукню та з яскравим макіяжем, яку ніхто в домі не знав.',
        'Детектив'
    ),
    (
        'Сяйво',
        'Стівен Кінг',
        '«Сяйво» (1977) — культовий готичний роман жахів Стівена Кінга, що розповідає про Джека
        Торренса, який влаштовується наглядачем ізольованого готелю «Оверлук» на зиму. Разом із
        дружиною та сином Денні, що володіє екстрасенсорним даром («сяйвом»), вони опиняються
        віч-на-віч із темними силами та привидами, які доводять батька до божевілля.',
        'Жахи'
    ),
    (
        'Гра престолів',
        'Джордж Мартін',
        '«Гра престолів» Джорджа Р. Р. Мартіна — це епічний фентезі-роман, перша книга циклу «Пісня
        льоду й полум''я», що розповідає про жорстоку боротьбу за владу між великими домами Вестеросу.
        Сюжет фокусується на політичних інтригах, громадянських війнах та насуванні магічної загрози
        з Півночі.',
        'Фентезі'
    ),
    (
        'Гаррі Поттер і філософський камінь',
        'Джоан Роулінг',
        '«Гаррі Поттер і філософський камінь» — це історія про 11-річного сироту, який дізнається,
        що він чарівник. Гаррі вирушає до школи магії «Гоґвортс», де знаходить справжніх друзів,
        вчиться чалкунству та перешкоджає злому чарівнику Волдеморту викрасти магічний камінь,
        що дарує безсмертя.',
        'Фентезі'
    ),
    (
        'Гаррі Поттер і таємна кімната',
        'Джоан Роулінг',
        '«Гаррі Поттер і Таємна кімната» — це друга книга та фільм про пригоди юного чарівника, у
        якому Гаррі на другому курсі Гоґвортсу розслідує серію загадкових нападів на учнів. Герої
        шукають легендарну Таємну кімнату, створену Салазаром Слизерином, щоб очистити школу від
        «нечистокровних» чарівників.',
        'Фентезі'
    ),
    (
        '451 градус за Фаренгейтом',
        'Рей бредбері',
        '«451 градус за Фаренгейтом» Рея Бредбері — це знаменитий роман-антиутопія про тоталітарне
        суспільство майбутнього, де книги заборонені, а «пожежники» їх спалюють, оскільки читання
        вважається небезпечним і шкідливим. Твір порушує проблеми цензури, втрати культури, духовної
        деградації та влади споживацького суспільства.',
        'Антиутопія'
    );
INSERT INTO book_copies
(book_id)
VALUES
    (1), (1), (1),(1),
    (2),(2),(2),
    (3),(3),
    (4),(4),(4),(4),
    (5),(5),
    (6),(6),(6),
    (7),(7),
    (8),(8),
    (9),(9),(9),
    (10),(10),
    (11),(11);



